pschatzmann/ESP32-A2DP/src/BluetoothA2DPSink.cpp
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at

//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
//
// Copyright 2020 Phil Schatzmann
// Copyright 2015-2016 Espressif Systems (Shanghai) PTE LTD

#include "BluetoothA2DPSink.h"

// to support static callback functions
BluetoothA2DPSink* actual_bluetooth_a2dp_sink;

/**
 * Constructor
 */
BluetoothA2DPSink::BluetoothA2DPSink() {
  actual_bluetooth_a2dp_sink = this;

#if A2DP_I2S_SUPPORT

  if (is_i2s_output) {
        // default i2s port is 0
        i2s_port = (i2s_port_t) 0;

        // setup default i2s config
        i2s_config = {
            .mode = (i2s_mode_t) (I2S_MODE_MASTER | I2S_MODE_TX),
            .sample_rate = 44100,
            .bits_per_sample = (i2s_bits_per_sample_t)16,
            .channel_format = I2S_CHANNEL_FMT_RIGHT_LEFT,
            .communication_format = (i2s_comm_format_t) I2S_COMM_FORMAT_STAND_I2S,
            .intr_alloc_flags = 0, // default interrupt priority
            .dma_buf_count = 8,
            .dma_buf_len = 64,
            .use_apll = false,
            #if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 0, 0)
			.tx_desc_auto_clear = true, // avoiding noise in case of data unavailability
            .fixed_mclk = 0,
            .mclk_multiple = I2S_MCLK_MULTIPLE_DEFAULT,
            .bits_per_chan = I2S_BITS_PER_CHAN_DEFAULT
			#else
			.tx_desc_auto_clear = true // avoiding noise in case of data unavailability
            #endif
        };

        // setup default pins
        pin_config = {
            #if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 0, 0)
            .mck_io_num = 0,
            #endif
            .bck_io_num = 26,
            .ws_io_num = 25,
            .data_out_num = 22,
            .data_in_num = I2S_PIN_NO_CHANGE
        };
    }
#endif
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 0, 0)
    s_avrc_peer_rn_cap.bits = 0;
    _lock_init(&s_volume_lock);
#endif
}

BluetoothA2DPSink::~BluetoothA2DPSink() {
    if (app_task_queue!=NULL){
        end();
    }
}



void BluetoothA2DPSink::end(bool release_memory) {
    // reconnect should not work after end
    is_autoreconnect_allowed = false;
    BluetoothA2DPCommon::end(release_memory);
    app_task_shut_down();

    // stop I2S
#if A2DP_I2S_SUPPORT
    if (is_i2s_output){
        ESP_LOGI(BT_AV_TAG,"uninstall i2s");
        if (i2s_driver_uninstall(i2s_port) != ESP_OK){
            ESP_LOGE(BT_AV_TAG,"Failed to uninstall i2s");
        }
        else {
            player_init = false;
        }
    }
#endif
    log_free_heap();
}

#if A2DP_I2S_SUPPORT

void BluetoothA2DPSink::set_pin_config(i2s_pin_config_t pin_config){
  this->pin_config = pin_config;
}

void BluetoothA2DPSink::set_i2s_port(i2s_port_t i2s_num) {
  i2s_port = i2s_num;
}

void BluetoothA2DPSink::set_i2s_config(i2s_config_t i2s_config){
  this->i2s_config = i2s_config;
}

#endif

void BluetoothA2DPSink::set_stream_reader(void (*callBack)(const uint8_t*, uint32_t), bool is_i2s){
  this->stream_reader = callBack;
  this->is_i2s_output = is_i2s;
}

void BluetoothA2DPSink::set_raw_stream_reader(void (*callBack)(const uint8_t*, uint32_t)){
    this->raw_stream_reader = callBack;
}

void BluetoothA2DPSink::set_on_data_received(void (*callBack)()){
  this->data_received = callBack;
}

// void BluetoothA2DPSink::set_on_connected2BT(void (*callBack)()){
//   this->bt_connected = callBack;
// }

// void BluetoothA2DPSink::set_on_dis_connected2BT(void (*callBack)()){
//   this->bt_dis_connected = callBack;
// }

// kept for backwards compatibility
void BluetoothA2DPSink::set_on_volumechange(void (*callBack)(int)){
  this->bt_volumechange = callBack;
}

void BluetoothA2DPSink::set_avrc_rn_volumechange(void (*callBack)(int)){
  this->bt_volumechange = callBack;
}

void BluetoothA2DPSink::set_avrc_rn_volumechange_completed(void (*callBack)(int)) {
    this->avrc_rn_volchg_complete_callback = callBack;
}

void BluetoothA2DPSink::start(const char* name, bool auto_reconnect){
    set_auto_reconnect(auto_reconnect, AUTOCONNECT_TRY_NUM);
    start(name);
}
/** 
 * Main function to start the Bluetooth Processing
 */
void BluetoothA2DPSink::start(const char* name)
{
    ESP_LOGD(BT_AV_TAG, "%s", __func__);
    log_free_heap();

    if (is_start_disabled){
        ESP_LOGE(BT_AV_TAG, "re-start not supported after end(true)");
        return;
    }

    //store parameters
    if (name) {
      this->bt_name = name;
    }
    ESP_LOGI(BT_AV_TAG,"Device name will be set to '%s'",this->bt_name);
    
    // Initialize NVS
    init_nvs();

    // reconnect management
    // grab last connnectiom, even if we dont use it now for auto reconnect
    get_last_connection();

    is_autoreconnect_allowed = true; // allow automatic reconnect
    if (reconnect_status==AutoReconnect){
        memcpy(peer_bd_addr, last_connection,ESP_BD_ADDR_LEN);

        // force disconnect first so that a subsequent connect has a chance to work
#ifdef A2DP_EXPERIMENTAL_DISCONNECT_ON_START
        ESP_LOGW(BT_AV_TAG,"A2DP_EXPERIMENTAL_DISCONNECT_ON_START");
        disconnect();
#else
        // trigger timeout
        delay(reconnect_delay);
#endif
    }

#if A2DP_I2S_SUPPORT
    // setup i2s
    init_i2s();
#endif

    // setup bluetooth
    init_bluetooth();

    // create application task 
    app_task_start_up();

    // Bluetooth device name, connection mode and profile set up 
    app_work_dispatch(ccall_av_hdl_stack_evt, BT_APP_EVT_STACK_UP, NULL, 0);
    
    // handle security pin
    if (is_pin_code_active) {
        // Set default parameters for Secure Simple Pairing 
        esp_bt_sp_param_t param_type = ESP_BT_SP_IOCAP_MODE;
        esp_bt_io_cap_t iocap = ESP_BT_IO_CAP_IO;
        esp_bt_gap_set_security_param(param_type, &iocap, sizeof(uint8_t));
        // invokes callbacks
        esp_bt_pin_type_t pin_type = ESP_BT_PIN_TYPE_VARIABLE;
        esp_bt_pin_code_t pin_code;
        esp_bt_gap_set_pin(pin_type, 0, pin_code);

    } else {
        // Set default parameters for Secure Simple Pairing 
        esp_bt_sp_param_t param_type = ESP_BT_SP_IOCAP_MODE;
        esp_bt_io_cap_t iocap = ESP_BT_IO_CAP_NONE;
        esp_bt_gap_set_security_param(param_type, &iocap, sizeof(uint8_t));
        // no callbacks
        esp_bt_pin_type_t pin_type = ESP_BT_PIN_TYPE_FIXED;
        esp_bt_pin_code_t pin_code;
        esp_bt_gap_set_pin(pin_type, 0, pin_code);

