pschatzmann/ESP32-A2DP/src/BluetoothA2DPSink.cpp
    }

    ESP_LOGI(BT_AV_TAG,"IDF Version %d.%d",ESP_IDF_VERSION_MAJOR,ESP_IDF_VERSION_MINOR);
    log_free_heap();

}

#if A2DP_I2S_SUPPORT

void BluetoothA2DPSink::init_i2s() { 
    ESP_LOGI(BT_AV_TAG,"init_i2s");
    if (is_i2s_output){
        ESP_LOGI(BT_AV_TAG,"init_i2s is_i2s_output");
        // setup i2s
        if (i2s_driver_install(i2s_port, &i2s_config, 0, NULL) != ESP_OK) {
            ESP_LOGE(BT_AV_TAG,"i2s_driver_install failed");
        } else {
            player_init = false; //reset player
        }

        // pins are only relevant when music is not sent to internal DAC
        if (i2s_config.mode & I2S_MODE_DAC_BUILT_IN) {
            if (i2s_set_pin(i2s_port, nullptr)!= ESP_OK) {
                ESP_LOGE(BT_AV_TAG,"i2s_set_pin failed");
            }      
            if (i2s_set_dac_mode(I2S_DAC_CHANNEL_BOTH_EN)!= ESP_OK){
                ESP_LOGE(BT_AV_TAG,"i2s_set_dac_mode failed");
            }
            ESP_LOGI(BT_AV_TAG, "Output will go to DAC pins");
        } else {
            if (i2s_set_pin(i2s_port, &pin_config) != ESP_OK) {
                ESP_LOGE(BT_AV_TAG,"i2s_set_pin failed");
            }
        }
    }
}

#if ESP_IDF_VERSION < ESP_IDF_VERSION_VAL(5, 1, 1)

esp_err_t BluetoothA2DPSink::i2s_mclk_pin_select(const uint8_t pin) {

    if(pin != 0 && pin != 1 && pin != 3) {
        ESP_LOGE(BT_APP_TAG, "Only support GPIO0/GPIO1/GPIO3, gpio_num:%d", pin);
        return ESP_ERR_INVALID_ARG;
    }
    switch(pin){
        case 0:
            PIN_FUNC_SELECT(PERIPHS_IO_MUX_GPIO0_U, FUNC_GPIO0_CLK_OUT1);
            WRITE_PERI_REG(PIN_CTRL, 0xFFF0);
            break;
        case 1:
            PIN_FUNC_SELECT(PERIPHS_IO_MUX_U0TXD_U, FUNC_U0TXD_CLK_OUT3);
            WRITE_PERI_REG(PIN_CTRL, 0xF0F0);
            break;
        case 3:
            PIN_FUNC_SELECT(PERIPHS_IO_MUX_U0RXD_U, FUNC_U0RXD_CLK_OUT2);
            WRITE_PERI_REG(PIN_CTRL, 0xFF00);
            break;
        default:
            break;
    }
    return ESP_OK;
}
#endif

#endif

bool BluetoothA2DPSink::is_connected() {
    return connection_state == ESP_A2D_CONNECTION_STATE_CONNECTED;
}

esp_a2d_mct_t BluetoothA2DPSink::get_audio_type() {
    return audio_type;
}

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 0, 0)
const char* BluetoothA2DPSink::get_connected_source_name() {
    if (is_connected()){
        return(remote_name);
    } else {
        return("unknown");
    }
}
#endif

int BluetoothA2DPSink::init_bluetooth()
{
    ESP_LOGD(BT_AV_TAG, "%s", __func__);
    if (!btStart()) {
        ESP_LOGE(BT_AV_TAG,"Failed to initialize controller");
        return false;
    }
    ESP_LOGI(BT_AV_TAG,"controller initialized");

    esp_bluedroid_status_t bt_stack_status = esp_bluedroid_get_status();

    if(bt_stack_status == ESP_BLUEDROID_STATUS_UNINITIALIZED){
        if (esp_bluedroid_init() != ESP_OK) {
            ESP_LOGE(BT_AV_TAG,"Failed to initialize bluedroid");
            return false;
        }
        ESP_LOGI(BT_AV_TAG,"bluedroid initialized");
    }

    while(bt_stack_status != ESP_BLUEDROID_STATUS_ENABLED){
        if (esp_bluedroid_enable() != ESP_OK) {
            ESP_LOGE(BT_AV_TAG,"Failed to enable bluedroid");
            delay(100);
            //return false;
        } else {
            ESP_LOGI(BT_AV_TAG,"bluedroid enabled"); 
        }
        bt_stack_status = esp_bluedroid_get_status();
    }

    if (esp_bt_gap_register_callback(ccall_app_gap_callback) != ESP_OK) {
        ESP_LOGE(BT_AV_TAG,"gap register failed");
        return false;
    }

#if A2DP_SPP_SUPPORT
    if (spp_active){
        if ((esp_spp_init(esp_spp_mode)) != ESP_OK) {
            ESP_LOGE(BT_AV_TAG,"esp_spp_init failed");
            return false;
        }
    }
#endif

    return true;
}


bool BluetoothA2DPSink::app_work_dispatch(app_callback_t p_cback, uint16_t event, void *p_params, int param_len)
{
    ESP_LOGD(BT_APP_TAG, "%s event 0x%x, param len %d", __func__, event, param_len);
    
    bt_app_msg_t msg;
    memset(&msg, 0, sizeof(bt_app_msg_t));

    msg.sig = APP_SIG_WORK_DISPATCH;
    msg.event = event;
    msg.cb = p_cback;

    if (param_len == 0) {
        return app_send_msg(&msg);
    } else if (p_params && param_len > 0) {
        if ((msg.param = malloc(param_len)) != NULL) {
            memcpy(msg.param, p_params, param_len);
            return app_send_msg(&msg);
        }
    }

    return false;
}

void BluetoothA2DPSink::app_work_dispatched(bt_app_msg_t *msg)
{
    ESP_LOGD(BT_AV_TAG, "%s", __func__);
    if (msg->cb) {
        msg->cb(msg->event, msg->param);
    }
}


bool BluetoothA2DPSink::app_send_msg(bt_app_msg_t *msg)
{
    ESP_LOGD(BT_AV_TAG, "%s", __func__);
    if (msg == NULL || app_task_queue == NULL) {
        ESP_LOGE(BT_APP_TAG, "%s app_send_msg failed", __func__);
        return false;
    }

    if (xQueueSend(app_task_queue, msg, 10 / portTICK_RATE_MS) != pdTRUE) {
        ESP_LOGE(BT_APP_TAG, "%s xQueue send failed", __func__);
        return false;
    }
    return true;
}


void BluetoothA2DPSink::app_task_handler(void *arg)
{
    ESP_LOGD(BT_AV_TAG, "%s", __func__);
    bt_app_msg_t msg;
    while (true) {
        if (!app_task_queue){
            ESP_LOGE(BT_APP_TAG, "%s, app_task_queue is null", __func__);
            delay(100);
        } else if (pdTRUE == xQueueReceive(app_task_queue, &msg, (portTickType)portMAX_DELAY)) {
            ESP_LOGD(BT_APP_TAG, "%s, sig 0x%x, 0x%x", __func__, msg.sig, msg.event);
            switch (msg.sig) {
            case APP_SIG_WORK_DISPATCH:
                ESP_LOGD(BT_APP_TAG, "%s, APP_SIG_WORK_DISPATCH sig: %d", __func__, msg.sig);
                app_work_dispatched(&msg);
                break;
            default:
                ESP_LOGW(BT_APP_TAG, "%s, unhandled sig: %d", __func__, msg.sig);
                break;
            } // switch (msg.sig)

            if (msg.param) {
                free(msg.param);
            }
        } else {
#ifdef A2DP_EXPERIMENTAL_RECONNECT_AFTER_IDLE
            // RECONNECTION MGMT
            // ESP_LOGI(BT_APP_TAG, "%s, xQueueReceive -> no data", __func__);
            if (reconnect_status==IsReconnecting && millis()>reconnect_timout){
                // if we do not reconnect within the timeout we try to reconnect again.
                if (connection_rety_count++ < try_reconnect_max_count) {
                    reconnect();
                }
            } else {
                delay(10);
            }
#else
            ESP_LOGI(BT_APP_TAG, "%s, xQueueReceive -> no data", __func__);
            delay(10);
#endif

