pschatzmann/ESP32-A2DP/src/BluetoothA2DPSink.cpp
}

int BluetoothA2DPSink::get_volume()
{
  // ESP_LOGI(BT_AV_TAG, "get_volume %d", s_volume);
  return s_volume;
}

void BluetoothA2DPSink::activate_pin_code(bool active){
    is_pin_code_active = active;
}

void BluetoothA2DPSink::confirm_pin_code()
{
  if (pin_code_int!=0) {
    confirm_pin_code(pin_code_int);
  } else {
    ESP_LOGI(BT_AV_TAG, "pincode not available (yet)");
  }
}

void BluetoothA2DPSink::confirm_pin_code(int code)
{
  switch(pin_code_request){
      case Confirm:
        ESP_LOGI(BT_AV_TAG, "-> %s",  to_str(peer_bd_addr));
        if (esp_bt_gap_ssp_confirm_reply(peer_bd_addr, true)!=ESP_OK){
            ESP_LOGE(BT_AV_TAG,"esp_bt_gap_ssp_passkey_reply");
        }
        break;
      case Reply:
        ESP_LOGI(BT_AV_TAG, "confirm_pin_code %d -> %s", code, to_str(peer_bd_addr));
        if (esp_bt_gap_ssp_passkey_reply(peer_bd_addr, true, code)!=ESP_OK){
            ESP_LOGE(BT_AV_TAG,"esp_bt_gap_ssp_passkey_reply");
        }
        break;
    default:
        ESP_LOGE(BT_AV_TAG, "No open request -> %s",  to_str(peer_bd_addr));
        break;
  }
}

/**
 * public Callbacks 
 * 
 */


#if A2DP_I2S_SUPPORT
void ccall_i2s_task_handler(void *arg) {
  ESP_LOGD(BT_AV_TAG, "%s", __func__);
  if (actual_bluetooth_a2dp_sink)
    actual_bluetooth_a2dp_sink->i2s_task_handler(arg);
}

#endif

void ccall_app_task_handler(void *arg) {
  ESP_LOGD(BT_AV_TAG, "%s", __func__);
  if (actual_bluetooth_a2dp_sink)
    actual_bluetooth_a2dp_sink->app_task_handler(arg);
}

void ccall_audio_data_callback(const uint8_t *data, uint32_t len) {
  //ESP_LOGD(BT_AV_TAG, "%s", __func__);
  if (actual_bluetooth_a2dp_sink)
    actual_bluetooth_a2dp_sink->audio_data_callback(data,len);
}

void ccall_app_a2d_callback(esp_a2d_cb_event_t event, esp_a2d_cb_param_t *param){
  ESP_LOGD(BT_AV_TAG, "%s", __func__);
  if (actual_bluetooth_a2dp_sink)
    actual_bluetooth_a2dp_sink->app_a2d_callback(event, param);
}

void ccall_app_rc_ct_callback(esp_avrc_ct_cb_event_t event, esp_avrc_ct_cb_param_t *param){
  ESP_LOGD(BT_AV_TAG, "%s", __func__);
  if (actual_bluetooth_a2dp_sink)
    actual_bluetooth_a2dp_sink->app_rc_ct_callback(event, param);
}

void ccall_app_gap_callback(esp_bt_gap_cb_event_t event, esp_bt_gap_cb_param_t *param){
  ESP_LOGD(BT_AV_TAG, "%s", __func__);
  if (actual_bluetooth_a2dp_sink)
    actual_bluetooth_a2dp_sink->app_gap_callback(event, param);
}

void ccall_av_hdl_stack_evt(uint16_t event, void *param){
    ESP_LOGD(BT_AV_TAG, "%s", __func__);
    if (actual_bluetooth_a2dp_sink) {
        actual_bluetooth_a2dp_sink->av_hdl_stack_evt(event, param);
    }
}

void ccall_av_hdl_avrc_evt(uint16_t event, void *param){
    ESP_LOGD(BT_AV_TAG, "%s", __func__);
    if (actual_bluetooth_a2dp_sink) {
        actual_bluetooth_a2dp_sink->av_hdl_avrc_evt(event, param);
    }
}

void ccall_av_hdl_a2d_evt(uint16_t event, void *param){
    ESP_LOGD(BT_AV_TAG, "%s", __func__);
    if (actual_bluetooth_a2dp_sink) {
        actual_bluetooth_a2dp_sink->av_hdl_a2d_evt(event, param);
    }
}

#if A2DP_I2S_SUPPORT

size_t BluetoothA2DPSink::i2s_write_data(const uint8_t* data, size_t item_size){
    size_t i2s_bytes_written = 0;
    if (!is_i2s_active){
        ESP_LOGE(BT_AV_TAG, "%s failed - inactive", __func__);
        return 0;
    }
    if (this->i2s_config.mode & I2S_MODE_DAC_BUILT_IN) {
        // special case for internal DAC output, the incomming PCM buffer needs 
        // to be converted from signed 16bit to unsigned
        int16_t* data16 = (int16_t*) data;
        
        //HACK: this is here to remove the const restriction to replace the data in place as per
        //https://github.com/espressif/esp-idf/blob/178b122/components/bt/host/bluedroid/api/include/api/esp_a2dp_api.h
        //the buffer is anyway static block of memory possibly overwritten by next incomming data.

        for (int i=0; i<item_size/2; i++) {
            int16_t sample = data[i*2] | data[i*2+1]<<8;
            data16[i]= sample + 0x8000;
        }
    } 

    if (i2s_config.bits_per_sample == I2S_BITS_PER_SAMPLE_16BIT){
        // standard logic with 16 bits
        if (i2s_write(i2s_port,(void*) data, item_size, &i2s_bytes_written, portMAX_DELAY)!=ESP_OK){
            ESP_LOGE(BT_AV_TAG, "i2s_write has failed");    
        }
    } else {
        if (i2s_config.bits_per_sample > 16){
            // expand e.g to 32 bit for dacs which do not support 16 bits
            if (i2s_write_expand(i2s_port,(void*) data, item_size, I2S_BITS_PER_SAMPLE_16BIT, i2s_config.bits_per_sample, &i2s_bytes_written, portMAX_DELAY) != ESP_OK){
                ESP_LOGE(BT_AV_TAG, "i2s_write has failed");    
            }
        } else {
            ESP_LOGE(BT_AV_TAG, "invalid bits_per_sample: %d", i2s_config.bits_per_sample);    
        }
    }

    // give envent processing some chance ?
    delay(1);
    
    return item_size;
}
#endif


//------------------------------------------------------------
// ==> Methods which are only supported in new ESP Release 4

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 0, 0)

void BluetoothA2DPSink::app_rc_tg_callback(esp_avrc_tg_cb_event_t event, esp_avrc_tg_cb_param_t *param)
{
    ESP_LOGD(BT_AV_TAG, "%s", __func__);
    switch (event) {
        case ESP_AVRC_TG_CONNECTION_STATE_EVT:
        case ESP_AVRC_TG_REMOTE_FEATURES_EVT:
        case ESP_AVRC_TG_PASSTHROUGH_CMD_EVT:
        case ESP_AVRC_TG_SET_ABSOLUTE_VOLUME_CMD_EVT:
        case ESP_AVRC_TG_REGISTER_NOTIFICATION_EVT:
        case ESP_AVRC_TG_SET_PLAYER_APP_VALUE_EVT:{
            app_work_dispatch(ccall_av_hdl_avrc_tg_evt, event, param, sizeof(esp_avrc_tg_cb_param_t));
            break;
        }
        default:
            ESP_LOGE(BT_AV_TAG, "Unsupported AVRC event: %d", event);
            break;
    }
    
}

void BluetoothA2DPSink::volume_set_by_controller(uint8_t volume)
{
    ESP_LOGI(BT_AV_TAG, "Volume is set by remote controller to %d", (uint32_t)volume * 100 / 0x7f);

    _lock_acquire(&s_volume_lock);
    s_volume = volume;
    _lock_release(&s_volume_lock);
    
    volume_control()->set_volume(s_volume);
    volume_control()->set_enabled(true);

    if (bt_volumechange!=nullptr){
        (*bt_volumechange)(s_volume);
    }    
}

void BluetoothA2DPSink::volume_set_by_local_host(uint8_t volume)
{
    ESP_LOGI(BT_AV_TAG, "Volume is set locally to: %d%%", (uint32_t)volume * 100 / 0x7f);

